package commands

import (
	"bot/src/bot"
	"bot/src/common"
	"bot/src/pizda/db"
	"bot/src/pizda/utils/const"
	t "bot/src/utils/types"
)

func Start(bot *bot.Bot, u t.Update) {
	var user t.User

	if u.FromChat() == nil {
		user = u.MyChatMember.From
	} else {
		user = *u.Message.From
	}

	bot.SendMessage(
		common.GenerateKeyboardMsg(
			user.ID,
			cnst.SaleKeyboard,
			"⬇️ Внизу, для удобства, есть клавиатура",
		),
	)

	if u.Message == nil || u.Message.Text == "/start" {
		// 		payments, err := db.Query.IfUserPays(bot.Ctx, user.ID)

		// 		if err != nil {
		// 			bot.Error("p start error: " + err.Error())
		// 		}

		bot.SendPhoto(t.Message{
			ChatId: user.ID,
			Caption:   "Привет подруга🫰  \nМеня зовут Виолетта. Я йога-терапевт в области женского здоровья .Моя программа направлена конкретно на восстановление и поддержание гинекологической системы женщины, индивидуальную работу с конкретными проблемами организма и коррекцию психо-эмоционального состояния.\n\nВ отличие от классической йоги, которая ориентирована на комплексное развитие тела и сознания мужчин и женщин, здесь я предлагаю более мягкий, адаптированный и целенаправленный подход, учитывающий состояние здоровья и цели молодых женщин. Это не просто тренировки, а выстроенная система, которая приведет тебя к изменениям в движении, дыхании, спорте.",
			Text:   "Привет подруга🫰  \nМеня зовут Виолетта. Я йога-терапевт в области женского здоровья .Моя программа направлена конкретно на восстановление и поддержание гинекологической системы женщины, индивидуальную работу с конкретными проблемами организма и коррекцию психо-эмоционального состояния.\n\nВ отличие от классической йоги, которая ориентирована на комплексное развитие тела и сознания мужчин и женщин, здесь я предлагаю более мягкий, адаптированный и целенаправленный подход, учитывающий состояние здоровья и цели молодых женщин. Это не просто тренировки, а выстроенная система, которая приведет тебя к изменениям в движении, дыхании, спорте.",
			Photo: "AgACAgIAAxkBAAIiSWkN8UDfFDM5rQ-OmIEkpBj65TzFAAIJD2sb55ZwSDJcoB39mgTjAQADAgADcwADNgQ",
			ReplyMarkup: &t.InlineKeyboardMarkup{
				InlineKeyboard: [][]t.InlineKeyboardButton{
					{
						{
							Text:         "Давай узнаем, подходит ли тебе этот курс🤔?",
							CallbackData: cnst.Whom,
						},
					},
				},
			},
		})

		db.Query.UpsertUser(bot.Ctx, db.UpsertUserParams{
			ID:        user.ID,
			FirstName: user.FirstName,
			LastName:  user.LastName,
			Username:  user.UserName,
		})
	}
}
